import { SSlideInterface } from "@/lib/Interfces";
import { createSlice, PayloadAction } from "@reduxjs/toolkit";

const initialState: SSlideInterface = {
  slides: [
    {
      id:'1a',
      type: 'Пакетне дослідженя',
      code: 'Код дослідження №964',
      title: 'Краса та здоров\'я волосся',
      description: '(Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
      price: 1697,
      oldPrice: 1897,
      promotion: true,
      dueDate: 'сьогодні',
      url: '/'
    },
    {
      id:'2a',
      type: 'Пакетне дослідженя',
      code: 'Код дослідження №964',
      title: 'Краса та здоров\'я волосся23',
      description: '(Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
      price: 1697,
      oldPrice: 1894,
      promotion: false,
      dueDate: 'сьогодні',
      url: '/'
    },
    {
      id:'3a',
      type: 'Пакетне дослідженя',
      code: 'Код дослідження №964',
      title: 'Краса та здоров\'я волосся Краса та здоров\'я волосся4',
      description: '(Загальний аналіз крові Загальний аналіз крові Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
      price: 1697,
      oldPrice: 1894,
      promotion: false,
      dueDate: 'сьогодні',
      url: '/'
    },
    {
      id:'4a',
      type: 'Пакетне дослідженя',
      code: 'Код дослідження №964',
      title: 'Краса та здоров\'я волосся2',
      description: '(Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
      price: 1697,
      oldPrice: 1894,
      promotion: false,
      dueDate: 'сьогодні',
      url: '/'
    },
    {
      id:'5a',
      type: 'Пакетне дослідженя',
      code: 'Код дослідження №964',
      title: 'Краса та здоров\'я волосся1',
      description: '(Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
      price: 1697,
      oldPrice: 1897,
      promotion: true,
      dueDate: 'сьогодні',
      url: '/'
    },
    {
      id:'6a',
      type: 'Пакетне дослідженя',
      code: 'Код дослідження №964',
      title: 'Краса та здоров\'я волосся3',
      description: '(Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
      price: 1697,
      oldPrice: 1894,
      promotion: true,
      dueDate: 'сьогодні',
      url: '/'
    },
    {
      id:'7a',
      type: 'Пакетне дослідженя',
      code: 'Код дослідження №964',
      title: 'Краса та здоров\'я волосся Краса та здоров\'я волосся ',
      description: '(Загальний аналіз крові Загальний аналіз крові Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
      price: 1697,
      oldPrice: 1894,
      promotion: true,
      dueDate: 'сьогодні',
      url: '/'
    },
 ],
  buttons: {
    btn1: {name: 'Популярні', active: true},
    btn2: {name: 'Акції', active: false},
  },
};

const servicesSlice = createSlice({
  name: "services",
  initialState,
  reducers: {
    serviceBtn: (state) => {
      state.buttons.btn1!.active = !state.buttons.btn1!.active;
      state.buttons.btn2!.active = !state.buttons.btn2!.active;
    },
    setItems(state, action: PayloadAction<SSlideInterface>) {
      state.slides = action.payload.slides;
      state.buttons = action.payload.buttons;
    },
  },
});

export const { serviceBtn, setItems } = servicesSlice.actions;
export default servicesSlice.reducer;
